import React, { useEffect } from "react";
import styles from "./Describtion.module.css";
import PageTitle from "../../NewsArticles/PageTitle";
import MasterAbout from "../MasterAbout/MasterAbout";
import Lesson from "../Lesson/Lesson";
import Trophy from "../Trophy/Trophy";
const Describtion = (props) => {
  useEffect(() => {
    window.scrollTo(0, 0);
  }, []);

  return (
    <>
      <div className={`${styles.aboutUs}`}>
        <div className="container">
          <PageTitle titleShow={"درباره بامبو"} />
        </div>
        <p>
          امروزه بسیاری از خدمات به صورت آنلاین ارائه داده میشوند و میبینیم که
          اینترنت روز به روز در زندگی ما بیشتر جای خود را باز میکند، از تاکسی
          های آنلاین بگیرید تا سفارش غذا. این نشان دهنده یک صنعت بسیار بزرگ و در
          حال پیشرفت و توسعه است، صنعتی که بدون شک بازار کار و درآمد بسیار خوبی
          برای کارمندان خود به همراه خواهد داشت. به جرات میتوان گفت که برنامه
          نویسی در تمام صنایع کاربرد دارد، چیزی که به صورت مشهود میتوان دید و
          غیرقابل انکار است. حوزه ای بسیار گسترده که روز به روز موقعیت های شغلیش
          بیشتر میشود.
          <br />
          ما با هدف تربیت برنامه نویسان حرفه ای سایت بوتواستارت را بنا نهادیم تا
          بتوانیم نیاز روزافزون بازار برای برنامه نویسان حرفه ای را پاسخ بدهیم.
          تیم ما متشکل از برنامه نویس هایی با سابقه کار در حوزه های وب و موبایل
          است و تمام تلاشمان را خواهیم کرد که با آموزش های مناسب و کاردبردی درست
          ترین مسیر را برای رسیدن به هدف به دانشجوهایمان نشان دهیم و با پشتیبانی
          کامل تا پایان راه همراه آن ها باشیم
          <br /> بامبو یکی از پرتلاش‌ترین و بروزترین وبسایت های آموزشی در سطح
          ایران است. که همیشه تلاش کرده تا بتواند جدیدترین و بروزترین مقالات و
          دوره‌های آموزشی را در اختیار علاقه‌مندان ایرانی قرار دهد.
        </p>
        <MasterAbout />
        <Lesson />
        <Trophy />
      </div>
    </>
  );
};

export default Describtion;
